{
  "model_name": "DeepSeek V3 Demo",
  "model_type": "deepseek_v3",
  "architectures": ["DeepseekV3ForCausalLM"],
  "vocab_size": 129280,
  "hidden_size": 4096,
  "intermediate_size": 11008,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "num_experts": 64,
  "num_experts_per_tok": 6,
  "moe_intermediate_size": 1408,
  "tie_word_embeddings": false,
  "hidden_act": "silu",
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "max_position_embeddings": 163840
}
